In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [511]:
data = pd.read_csv('train.csv')

In [512]:
data.shape

(614, 13)

In [513]:
data.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [514]:
data['Gender'].value_counts()

Male      489
Female    112
Name: Gender, dtype: int64

In [515]:
data['Self_Employed'].value_counts()

No     500
Yes     82
Name: Self_Employed, dtype: int64

In [516]:
columns = data.columns

In [517]:
'''for i in columns[1:]:
    print(i)
    print(data[i].value_counts())
    print("\n")'''

'for i in columns[1:]:\n    print(i)\n    print(data[i].value_counts())\n    print("\n")'

In [518]:
data['Gender'].isnull().sum().any()

True

In [519]:
'''for i in columns[1:]:
    print(i)
    print(data[i].isnull().sum().any())
    print("\n")'''

'for i in columns[1:]:\n    print(i)\n    print(data[i].isnull().sum().any())\n    print("\n")'

In [520]:
data.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [521]:
data['Self_Employed'].isnull().sum()

32

In [522]:
#sns.heatmap(data.corr(), annot = True)

In [523]:
data['Loan_Status'].value_counts()

Y    422
N    192
Name: Loan_Status, dtype: int64

In [524]:
d = {'Y':1,'N':0}

data['Loan_Status'][1]

'N'

In [525]:
data.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [526]:
#sns.jointplot(x = 'ApplicantIncome', y = 'LoanAmount', data = data )

In [527]:
data.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,592.000000,600.00000,564.000000
mean,5403.459283,1621.245798,146.412162,342.00000,0.842199
std,6109.041673,2926.248369,85.587325,65.12041,0.364878
min,150.000000,0.000000,9.000000,12.00000,0.000000
25%,2877.500000,0.000000,100.000000,360.00000,1.000000
50%,3812.500000,1188.500000,128.000000,360.00000,1.000000
75%,5795.000000,2297.250000,168.000000,360.00000,1.000000
max,81000.000000,41667.000000,700.000000,480.00000,1.000000

In [528]:
data['LoanAmount'].fillna(data['LoanAmount'].mean(), inplace=True)
data['Self_Employed'].fillna('No', inplace=True)
data['Loan_Amount_Term'].fillna(data['Loan_Amount_Term'].mean(),inplace=True)
data['Credit_History'].fillna(1,inplace=True)
data['Married'].fillna('Yes',inplace=True)
data['Gender'].fillna('Male',inplace=True)
data['Dependents'].fillna('0',inplace=True)

In [529]:
data.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,146.412162,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.000000,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.000000,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.000000,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.000000,360.0,1.0,Urban,Y

In [530]:
#data['app_inc'] = data['ApplicantIncome'].apply(np.log)
data.head()
data['total_inc'] = data['ApplicantIncome']+data['CoapplicantIncome']
data.head()
data.describe()
data['loan_amount_lg'] = data['LoanAmount'].apply(np.log)
data['total_inc_log'] = data['total_inc'].apply(np.log) 
data.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,total_inc,loan_amount_lg,total_inc_log
0,LP001002,Male,No,0,Graduate,No,5849,0.0,146.412162,360.0,1.0,Urban,Y,5849.0,4.986426,8.674026
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.000000,360.0,1.0,Rural,N,6091.0,4.852030,8.714568
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.000000,360.0,1.0,Urban,Y,3000.0,4.189655,8.006368
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.000000,360.0,1.0,Urban,Y,4941.0,4.787492,8.505323
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.000000,360.0,1.0,Urban,Y,6000.0,4.948760,8.699515

In [531]:
testdf = pd.read_csv('test.csv')

In [532]:
testdf['LoanAmount'].fillna(data['LoanAmount'].mean(), inplace=True)
testdf['Self_Employed'].fillna('No', inplace=True)
testdf['Loan_Amount_Term'].fillna(data['Loan_Amount_Term'].mean(),inplace=True)
testdf['Credit_History'].fillna(1,inplace=True)
testdf['Married'].fillna('Yes',inplace=True)
testdf['Gender'].fillna('Male',inplace=True)
testdf['Dependents'].fillna('0',inplace=True)

In [533]:
#testdf['app_inc'] = testdf['ApplicantIncome'].apply(np.log)

testdf['total_inc'] = testdf['ApplicantIncome']+testdf['CoapplicantIncome']
testdf.describe()
testdf['loan_amount_lg'] = testdf['LoanAmount'].apply(np.log)
testdf['total_inc_log'] = testdf['total_inc'].apply(np.log) 
testdf.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,total_inc,loan_amount_lg,total_inc_log
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban,5720,4.700480,8.651724
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban,4576,4.836282,8.428581
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban,6800,5.337538,8.824678
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,1.0,Urban,4886,4.605170,8.494129
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban,3276,4.356709,8.094378

In [534]:
#testdf['app_inc'].value_counts()

In [535]:
testdf['loan_amount_lg'].fillna(data['LoanAmount'].mean(), inplace=True)

In [536]:
testdf.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,total_inc,loan_amount_lg,total_inc_log
count,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000
mean,4805.599455,1569.577657,136.272645,342.528610,0.839237,6375.177112,4.829173,8.617263
std,4910.685399,2334.232099,60.957720,64.620402,0.367814,5199.423594,0.416601,0.475716
min,0.000000,0.000000,28.000000,6.000000,0.000000,1760.000000,3.332205,7.473069
25%,2864.000000,0.000000,101.000000,360.000000,1.000000,4156.000000,4.615121,8.332308
50%,3786.000000,1025.000000,126.000000,360.000000,1.000000,5205.000000,4.836282,8.557375
75%,5060.000000,2430.500000,157.500000,360.000000,1.000000,6980.000000,5.059420,8.850789
max,72529.000000,24000.000000,550.000000,480.000000,1.000000,72529.000000,6.309918,11.191742

In [549]:
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
var_mod = ['Gender','Married','Dependents','Education','Self_Employed','Property_Area','Loan_Status']
le=LabelEncoder()
ohe = OneHotEncoder()
for i in var_mod:
        data[i]=le.fit_transform(data[i])
        if(i!='Loan_Status'):
          testdf[i]=le.fit_transform(testdf[i])

IOPub data rate exceeded.
The notebook server will temporarily stop sending output
to the client in order to avoid crashing it.
To change this limit, set the config variable
`--NotebookApp.iopub_data_rate_limit`.

In [ ]:
data.head()
testdf.describe()

In [ ]:
target = data['Loan_Status']

In [ ]:
data.drop('Loan_ID', inplace = True, axis = 1)

data.drop('Loan_Status', inplace = True, axis = 1)

In [ ]:
#data.drop('Loan_Status', inplace = True, axis = 1)

In [ ]:
'''data.drop('Gender', inplace = True, axis = 1)
data.drop('Married', inplace = True, axis = 1)
data.drop('Self_Employed', inplace = True, axis = 1)
data.drop('Education', inplace = True, axis = 1)

testdf.drop('Gender', inplace = True, axis = 1)
testdf.drop('Married', inplace = True, axis = 1)
testdf.drop('Self_Employed', inplace = True, axis = 1)
testdf.drop('Education', inplace = True, axis = 1)''

In [ ]:
from sklearn.model_selection import train_test_split

In [ ]:
X_train, X_test, y_train, y_test = train_test_split(data, target,test_size =0.2)

In [ ]:
from sklearn.ensemble import RandomForestClassifier

In [ ]:
model = RandomForestClassifier(n_estimators=40,criterion='entropy', random_state=3)

In [551]:
model.fit(X_train, y_train)
#model.fit(data, target)

ValueError: setting an array element with a sequence.

In [550]:
y_pred = model.predict(X_test)

NotFittedError: Estimator not fitted, call `fit` before exploiting the model.

In [498]:
from sklearn.metrics import confusion_matrix

In [499]:
cm = confusion_matrix(y_pred,y_test)

In [500]:
cm

array([[20,  5],
       [14, 84]])

In [501]:
from sklearn.cross_validation import KFold 
from sklearn import metrics

In [502]:
from sklearn.model_selection import cross_val_score

In [503]:
acc = cross_val_score(estimator = model, X = X_train, y= y_train, cv = 10)

In [504]:
acc.mean()

0.76787755102040811

In [505]:
acc.std()
#data.head()

0.063204138376883795

In [506]:
imp = pd.DataFrame({'col':data.columns, 'feat':model.feature_importances_})
imp.sort_values(by = 'feat', ascending=False)

                  col      feat
9      Credit_History  0.182767
5     ApplicantIncome  0.125477
13      total_inc_log  0.123142
11          total_inc  0.113807
7          LoanAmount  0.108554
12     loan_amount_lg  0.106266
6   CoapplicantIncome  0.075869
10      Property_Area  0.037411
2          Dependents  0.034785
8    Loan_Amount_Term  0.025929
1             Married  0.024287
0              Gender  0.014475
3           Education  0.013924
4       Self_Employed  0.013307

In [507]:
data.head().shape

(5, 14)

In [443]:
id = testdf['Loan_ID']

In [444]:
testdf.drop('Loan_ID', axis = 1, inplace = True)

In [445]:
testdf.shape
#results = model.predict(testdf)

(367, 10)

In [446]:
data.head()

,Dependents,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,total_inc,loan_amount_lg,total_inc_log
0,0,5849,0.0,146.412162,360.0,1.0,2,5849.0,4.986426,8.674026
1,1,4583,1508.0,128.000000,360.0,1.0,0,6091.0,4.852030,8.714568
2,0,3000,0.0,66.000000,360.0,1.0,2,3000.0,4.189655,8.006368
3,0,2583,2358.0,120.000000,360.0,1.0,2,4941.0,4.787492,8.505323
4,0,6000,0.0,141.000000,360.0,1.0,2,6000.0,4.948760,8.699515

In [447]:
testdf.describe()

,Dependents,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,total_inc,loan_amount_lg,total_inc_log
count,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000
mean,0.806540,4805.599455,1569.577657,136.272645,342.528610,0.839237,1.079019,6375.177112,4.829173,8.617263
std,1.065177,4910.685399,2334.232099,60.957720,64.620402,0.367814,0.824337,5199.423594,0.416601,0.475716
min,0.000000,0.000000,0.000000,28.000000,6.000000,0.000000,0.000000,1760.000000,3.332205,7.473069
25%,0.000000,2864.000000,0.000000,101.000000,360.000000,1.000000,0.000000,4156.000000,4.615121,8.332308
50%,0.000000,3786.000000,1025.000000,126.000000,360.000000,1.000000,1.000000,5205.000000,4.836282,8.557375
75%,2.000000,5060.000000,2430.500000,157.500000,360.000000,1.000000,2.000000,6980.000000,5.059420,8.850789
max,3.000000,72529.000000,24000.000000,550.000000,480.000000,1.000000,2.000000,72529.000000,6.309918,11.191742

In [448]:
result = model.predict(testdf)

In [449]:
test = pd.read_csv('test.csv')

In [450]:
df_output = pd.DataFrame()

df_output['Loan_ID'] = test['Loan_ID']
df_output['Loan_Status'] = result
df_output[['Loan_ID','Loan_Status']].to_csv('out1.csv', index=False)

In [451]:
out = pd.read_csv('out1.csv')
out.head()

    Loan_ID  Loan_Status
0  LP001015            1
1  LP001022            1
2  LP001031            1
3  LP001035            1
4  LP001051            1

In [452]:
out['Loan_Status'] = out['Loan_Status'].map(lambda s: 'Y' if s == 1 else 'N')

In [453]:
out.head()

    Loan_ID Loan_Status
0  LP001015           Y
1  LP001022           Y
2  LP001031           Y
3  LP001035           Y
4  LP001051           Y

In [508]:
df_output = pd.DataFrame()

df_output['Loan_ID'] = out['Loan_ID']
df_output['Loan_Status'] = out['Loan_Status']
df_output[['Loan_ID','Loan_Status']].to_csv('out4_new.csv', index=False)

In [509]:
out = pd.read_csv('out3_new.csv')

In [510]:
out.head()

    Loan_ID Loan_Status
0  LP001015           Y
1  LP001022           Y
2  LP001031           Y
3  LP001035           Y
4  LP001051           Y